samuelclay/turntouch-remote/firmware/nrf51/src/main.c
        case BLE_ADV_EVT_WHITELIST_REQUEST:
        {
            // ble_gap_whitelist_t whitelist;
            // ble_gap_addr_t    * p_whitelist_addr[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
            // ble_gap_irk_t     * p_whitelist_irk[BLE_GAP_WHITELIST_IRK_MAX_COUNT];
            //
            // whitelist.addr_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
            // whitelist.irk_count  = BLE_GAP_WHITELIST_IRK_MAX_COUNT;
            // whitelist.pp_addrs   = p_whitelist_addr;
            // whitelist.pp_irks    = p_whitelist_irk;
            //
            // err_code = dm_whitelist_create(&m_app_handle, &whitelist);
            // APP_ERROR_CHECK(err_code);
            //
            // err_code = ble_advertising_whitelist_reply(&whitelist);
            // APP_ERROR_CHECK(err_code);
            break;
        }

        default:
            break;
    }
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    // YOUR_JOB: Add code to initialize the services used by the application.
}

// =========
// = Power =
// =========

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;

    rtt_print(0, "%s%sStarting up Turn Touch Remote%s\n", RTT_CTRL_TEXT_BRIGHT_YELLOW,
                                                          RTT_CTRL_BG_BRIGHT_MAGENTA, 
                                                          RTT_CTRL_RESET);
    
    // Initialize buttons
    clock_initialization();
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, 
                   APP_TIMER_OP_QUEUE_SIZE, NULL);
    bsp_configuration();

    // Initialize
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    sec_params_init();

    // Start execution
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    // err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    // APP_ERROR_CHECK(err_code);

    while (true)
    {
        // app_sched_execute();
        // power_manage();
    }
}


/**
 * @}
 */
